students = [
    ('Александрова', 'Анна', 'Костянтинівна', 'ж', 20, 1),
    ('Биліна', 'Олександра', 'Денисівна', 'ж', 20, 3),
    ('Богусевич', 'Денис', 'Анатолійович', 'ж', 19, 1),
    ('Говядін', 'Кирило', 'Олександрович', 'ж', 18, 1),
    ('Іспірян', 'Анна', 'Самвелівна', 'ч', 23, 3),
    ('Качуровська', 'Юлія', 'Сергіївна', 'ч', 18, 3),
    ('Ковальчук', 'Анна', 'Миколаївна', 'ж', 23, 2),
    ('Колко', 'Олександр', 'Олександрович', 'ч', 22, 3),
    ('Кухарук', 'Соломія', 'Тарасівна', 'ж', 18, 3),
    ('Міхуровська', 'Наталія', 'Іванівна', 'ж', 23, 2),
    ('Нгуєн', 'Фу', 'Даі', 'ч', 21, 1),
    ('Ромашко', 'Георгій', 'Романович', 'ж', 21, 3),
    ('Соловій', 'Катерина', 'Ігорівна', 'ж', 22, 2),
    ('Сугоняк', 'Роман', 'Ярославович', 'ч', 19, 1),
    ('Судейко', 'Ілля', 'Юрійович', 'ж', 19, 1),
    ('Ужвенко', 'Юлія', 'Константинівна', 'ж', 19, 2),
    ('Чоботар', 'Максим', 'Сергійович', 'ч', 18, 3),
    ('Чучман', 'Дмитро', 'Олександрович', 'ж', 19, 3),
    ('Щур', 'Олександр', 'Олегович', 'ж', 20, 3),
    ('Студент', 'Приклад', 'Надіславович', 'ж', 18, 1),
    ('Німець', 'Надіслав', 'Вікторович', 'ж', 18, 2),
]

male_names = {}

for student in students:
    if student[3] == 'ч':
        name = student[1]
        male_names[name] = male_names.get(name, 0) + 1

female_names = {}

for student in students:
    if student[3] == 'ж':
        name = student[1]
        female_names[name] = female_names.get(name, 0) + 1

most_common_male_name = max(male_names, key=male_names.get)

most_common_female_name = max(female_names, key=female_names.get)

print(f"Найбільш поширене чоловіче ім'я: {most_common_male_name}")
print(f"Найбільш поширене жіноче ім'я: {most_common_female_name}")
